src/graphviz/linkedList.dot
digraph g {
Head [label="head"];
Head -> 1
1[label="1\n0x5f4e03efb310"]
1->2
2[label="100\n0x5f4e03efb330"]
2->3
3[label="2\n0x5f4e03efb2f0"]
3->4
4[label="3\n0x5f4e03efb2b0"]
4->5
5[label="99\n0x5f4e03efb2d0"]
5->6
6[label="nullptr"]
}
